cases/subsonic/Zhang/We8500/b_3Dinj/setup/constant/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiation       off;
radiationModel  none;

// ************************************************************************* //
