cases/subsonic/Zhang/We8500/b_3Dinj/setup/constant/smoothingProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      smoothingProperties;
}

smoothBandwidth   0.0048;   // 3 x Dinj = 3 x 1.6mm
