cases/subsonic/Zhang/We8500/b_3Dinj/setup/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// FASE 2 — Spray attivo (cloud Madabhushi)
//
// Modello breakup: Madabhushi (2003) + Lambert (ILASS 2019)
// Drag:           MadabhushiDragForce — FIX-DR4 (Sp scala con Dinj^2)
//
// Copiare come constant/sprayCloudProperties prima del run spray:
//   cp constant/sprayCloudProperties.spray constant/sprayCloudProperties
//

solution
{
    active                      true;
    coupled                     true;
    transient                   yes;
    cellValueSourceCorrection   on;
    maxCo                       0.3;
    nSubCycles                  1;

    sourceTerms
    {
        schemes
        {
            rho         semiImplicit 1;
            U           semiImplicit 1;
            h           semiImplicit 1;
            radiation   explicit 1;
        }
    }

    interpolationSchemes
    {
        rho         cell;
        U           cell;
        thermo:mu   cell;
        T           cell;
        Cp          cell;
        kappa       cell;
        p           cell;
    }

    integrationSchemes
    {
        U   analytical;
        T   analytical;
    }
}

constantProperties
{
    T0              288;
    rho0            998;
    Cp0             4186;
    constantVolume  false;
}

subModels
{
    // -----------------------------------------------------------------
    // DRAG: Madabhushi custom (FIX-DR4 applicato)
    // CdBlob=1.696: Wu et al. (1997) Fig.10-11
    // CdDisc=1.2:   Madabhushi (2003) Eq.(7), Lambert (2019)
    // Sp scala con Dinj^2 — Lambert (2019) Eq. 12-452
    // -----------------------------------------------------------------
    particleForces
    {
        MadabhushiDragForce
        {
            CdBlob  2.16;
            CdDisc  1.2;
            C0      0.46;
            Dinj    0.0016;
            debug   false;
        }
        gravity;
    }

    // -----------------------------------------------------------------
    // INIEZIONE: coneNozzleInjection
    // Zhang Sim4 (We8500, TL=100%): D=1.6mm, mDot=0.0452 kg/s, V_jet=22.5 m/s
    // SOI relativo a startTime della FASE 2
    // -----------------------------------------------------------------
    injectionModels
    {
        model1
        {
            type                coneNozzleInjection;

            SOI                 0.01;
            duration            0.02;

            massTotal           0.000904;  // mDot * duration [kg] = 0.0452*0.02

            parcelBasisType     mass;
            parcelsPerSecond    6.25e6;
            minParticlesPerParcel 1e-10;

            injectionMethod     disc;
            outerDiameter       0.0016;
            innerDiameter       0.0;

            position            (0.015 0.0 0.0);
            direction           (0 0 1);

            flowType            flowRateAndDischarge;
            Cd                  constant 1;

            flowRateProfile     constant 4.52e-05;  // mDot/rho [m3/s] (Zhang Sim4)

            thetaInner          constant 0.0;
            thetaOuter          constant 0.01;

            sizeDistribution
            {
                type    fixedValue;
                fixedValueDistribution
                {
                    // D0 = Dinj = 1.6 mm
                    // Madabhushi (2003): blob injected with d = D_jet
                    value   0.0016;
                }
            }
        }
    }

    dispersionModel             stochasticDispersionRAS;
    stochasticDispersionRASCoeffs {}

    heatTransferModel           RanzMarshall;

    RanzMarshallCoeffs  { BirdCorrection true; }

    compositionModel            singlePhaseMixture;
    phaseChangeModel            none;
    surfaceFilmModel            none;
    atomizationModel            none;

    // -----------------------------------------------------------------
    // BREAKUP: Madabhushi custom
    // [1] Madabhushi (2003), [2] Lambert (2019), [3] Pilch & Erdman (1987)
    // FIX-MB5, FIX-MB6, FIX-MB8, FIX-DR3 tutti applicati nel .C
    // -----------------------------------------------------------------
    breakupModel    Madabhushi;

    MadabhushiCoeffs
    {
        C0       0.46;     // user override
        FLig     0.4;      // user override
        b0       2.44;     // user override
        b1       1.73;     // user override
        CdBlob   2.16;     // user override
        Dinj     0.0016;
        nChildren 5;        // Madabhushi (2003): five smaller droplet parcels
        debug   false;
    }

    stochasticCollisionModel    trajectory;

    trajectoryCoeffs
    {
        cSpace          1;
        cTime           1;
        coalescence     on;
    }

    radiation                   off;

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid { H2O 1; }
        );
    }

    patchInteractionModel       localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            gasInlet    { type escape; }
            outletRight { type escape; }
            outletTop   { type escape; }
            bottomWall  { type stick; }
            filmTopWall { type stick; }
            stepWall    { type stick; }
            front       { type escape; }
            back        { type escape; }
        );
    }
}

cloudFunctions
{
    WeberNumber1    { type WeberNumber;    }
    ReynoldsNumber1 { type ReynoldsNumber; }
}

// ************************************************************************* //
